## Node.js
Node.js - это серверная платформа для работы с JavaScript через движок V8. JavaScript выполняет действие на стороне клиента, а Node — на сервере. С помощью Node можно писать 
полноценные приложения. Node умеет работать с внешними библиотеками, вызывать команды из кода на JavaScript и выполнять роль веб-сервера.

## Переваги застосування Node.js
  1.
**Простий і широко відомий JavaScript** Звичайно, платформа передбачає власні інструменти та особливості, наприклад, тут немає браузерних API, coockie або DOM, зате присутні власні бібліотеки та інші цікаві рішення. Але в основному використовуються можливості і синтаксис всім звичного JavaScript.
  2.
**Багата стандартна бібліотека.** Платформа від самого початку має широкий набір можливостей, а в нових версіях бібліотека поповнюється і поліпшується.
  3.
**Величезне зовнішніх бібліотек і готових модулів.** Використання пакетного менеджера NPM дозволяє постійно розвивати екосистему Node. Сьогодні число опенсорсний пакетів в ньому 
перевалило за цифру 500 тисяч і постійно зростає.
  4.
**Движок V8** JavaScript створювався як інтерпретується скриптова мова. Але процес його інтерпретації не настільки швидкий і простий, як хотілося б. При цьому мова розвивається, він давно став повноцінним, на JavaScript можна писати великі програми. А тому наявність компілятора стало не просто плюсом, але - необхідністю.

*Коротка загальна характеристика проекту.*

### Учасники:

Кучеренко Іван 

### Методичні вказівки:
- [Heruko](https://jace-dev.herokuapp.com/design/js-talks#/)

### Контактні дані:
 - [GitHub](https://github.com/IKu4er)
 - [Телеграм](http://t.me/rmnstepaniuk)


